app/views/movies/index.html.erb

<h1><%= pluralize(@movies.size, 'Movie') %></h1>
---
SELECT "movies".* FROM "movies" WHERE (released_on <= '2013-12-25 05:49:23.135227') ORDER BY released_on DESC