app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "title" = ?, "description" = ?, "rating" = ?, "total_gross" = ?, "cast" = ?, "director" = ?, "released_on" = ?, "updated_at" = ? WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)