app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (released_on <= '2013-12-25 05:49:23.135227') ORDER BY released_on DESC
---
  def index
    @movies = Movie.all