app/controllers/reviews_controller.rb

  def index
    @movie = Movie.find(params[:movie_id])
    @reviews = @movie.reviews.to_a
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]

  def new
    @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.create(review_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "reviews" ("comment", "created_at", "full_name", "movie_id", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)